package modelo;

/**
 *
 * @author aldanielago
 */
public class Conversor {
    public String conversor_base(int number, int base) {
        StringBuilder resultBuilder = new StringBuilder();
        while (number > 0) {
            int digit = number % base;
            char digitChar = getDigitChar(digit, base);
            if(digit > 30){
                System.out.println("Base: " + base);
                System.out.println(digitChar + " = " + digit);
            }
            resultBuilder.insert(0, digitChar);
            number /= base;
        }
        return resultBuilder.toString();
    }
    
    public static char getDigitChar(int value, int base) {
        char[] chars = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyzαβɣδεζηθικλμνξοπρςτυφχψω❜❝❞、。〃「」『』〝〞︰﹁﹂﹃﹄﹐﹒﹔﹕！＃＄％＆＊，．：；？＠～•…¿“‘‐‗„‟‣″‴‶‷ˀˁ˂˃˄˅ˠ⁘⁙⁚⁛⁜⁝《》【】〔〕︷︸︹︺︻︼︽︽︾︿﹀﹛﹜﹝﹞﹤﹥（）✾✽✣✤❀✿❃❁❋❊⚜✥✻✼❇❈❉⚘⁕☘֍𝄀𝄁𝄂𝄃𝄄𝄆𝄇𝄋𝄌𝄍𝄎𝄏𝄐𝄑𝄓𝄔𝄕𝄖𝄗𝄘𝄙𝄚𝄛𝄜𝄝𝄞𝄟𝄠𝄡𝄢𝄣𝄤𝄥𝄦𝄩𝄪𝄫𝄬v𝄮𝄯𝄰𝄱𝄲𝄳𝄴𝄵𝄺𝄻𝄼𝄽𝄾𝄿𝅀𝅁𝅂𝅃𝅄𝅅𝅆𝅇𝅈𝅉𝅊𝅋𝅌𝅍𝅎𝅏𝅐𝅑𝅒𝅓𝅔𝅕𝅖𝅗𝅘𝅙𝅚𝅛𝅜𝅝𝅗𝅥𝅘𝅥𝅘𝅥𝅮𝅘𝅥𝅯𝅘𝅥𝅰𝅘𝅥𝅱𝅘𝅥𝅲 𝅧 𝅨 𝅩 𝅪 𝅫𝅬 𝅮 𝅯 𝅰 𝅱 𝅲 𝆊 𝆋𝆌𝆍𝆎𝆏𝆐𝆔𝆖𝆘𝆝𝆶𝆷𝆸𝇇𝇈𝇉𝇊𝇋𝇌𝇍𝇎𝇐𝇑𝇒𝇓𝇔𝇕𝇖𝇗𝇘𝇙𝇚𝇛𝇜ϟ☀☁☂☃☄☉☼☽☾♁♨❄❅❆✺☇☈★☆℃℉☠☤☥☦☧☨☩☪☫☬☮☭☯☸☽☾♕♚♛✙✚✛✜✝✞✟✠✡✢卍卐‱№℗℠℡℀℁℅℆⅍☊☎☏✁✂✃✄✆✇✈✉✎✏✐✑✒™©®‰§¶⌗⌖⌨Ⓜ♲♳♴♵♶♷♸♹♺♻♼♽♈︎♉︎♊︎♋︎♌♍︎♎︎♏︎♐︎♑︎♒︎♓ˇ∛∜☑☒✓✔☹☺☻〠ヅツ㋡تシッ㋛〲〴ϡﭢ⍢⍤⍥⍨⍩ὃ☃🜀🜁🜂🜃🜄🜅🜆🜇🜈🜉🜊🜋🜌🜍🜎🜏🜐🜑🜒🜓🜔🜕🜖🜗🜘🜙🜚🜛🜜🜝🜞🜟🜠🜡🜢🜣🜤🜥🜦🜧🜨🜩🜪🜫🜬🜭🜮🜯🜰🜱🜲🜳🜴🜵🜶🜷🜸🜹🜺🜻🜼🜽🜾🜿🝀🝁🝂🝃🝄🝅🝆🝇🝈🝉🝊🝋🝌🝍🝎🝏🝐🝑🝒🝓🝔🝕🝖🝗🝘🝙🝚🝛🝜🝝🝞🝟🝠🝡🝢🝣🝤🝥🝦🝧🝨🝩🝪🝫🝬🝭🝮🝯🝰🝱🝲♔♕♖♗♘♙♚♛♜♝♡♢♤♧≛⋆★⍣☆✡✦✧✩✪✫✬✭✮✯✰⁂⁎⁑⌑☸✢✣✤✥✱✲✴✵✶✷✸✹✺✻✽✾❂❃❇❈❉❊❋⚝❄❆❅☪⭑⭒⛤⛥⛦⛧*⧆ ؀؁؂ ؃؆؇؈ ؉؊؋ ،؍ ؎ ؏ ؐ ؑ ؒ ؓ ؔ ؕ ؖ ؘؙؚؗ ؞ ؟ ء آ أ ؤ إ ئ ا ب ة ت ث ج ح خ د ذ ر ز س ش ص ض ط ظ ع غ ػ ؼ ؽ ؾ ؿ ـ ف ق ك ل م ن ه و ى ي ٮ ٯٰ ٲ ٳ ٴ ٵ ٶ ٷ ٸ ٹ ٺ ٻ ټ ٽ پ ٿ ڀ ځ ڂ ڃ ڄ څ چ ڇ ڈ ډ ڊ ڋ ڌ ڍ ڎ ڏ ڐ ڑ ڒ ړ ڔ ڕ ږ ڗ ژ ڙ ښ ڛ ڜ ڝ ڞ ڟ ڠ ڡ ڢ ڣ ڤ ڥ ڦ ڧ ڨ ک ڪ ګ ڬ ڭ ڮ گ ڰ ڱ ڲ ڳ ڴ ڵ ڶ ڷ ڸ ڹ ں ڻ ڼ ڽ ھ ڿ ۀ ہ ۂ ۃ ۄ ۅ ۆ ۇ ۈ ۉ ۊ ۋ ی ۍ ێ ۏ ۑ ے ۓ۝۞۩ ۯ۰۱۲۳۴۵۶۷۸㊊㊋㊌㊍㊎㊏㊐㊑㊒㊓㊔㊕㊖㊗㊘㊙㊚㊛㊜㊝㊞㊟㊠㊡㊢㊣㊤㊥㊦㊧㊨㊩㊪㊫㊬ぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆるれろゎわゐゑをんゔゕ゛゜ゝゞゟ゠ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロヮワヰヱヲンヴヵヶヷヸヹヺ・ーЀЁЂЃЄЅІЇЈЉЊЋЌЍЎЏАБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдежзийклмнопрстуфхцчшщъыьэюяѐѕіїјљњћќѝўџѠѡѢѣѤѥѦѧѨѩѪѫѬѭѮѯѰѱѲѳѴѵѶѷѸѹѺѻѼѽѾѿҀҁ҂҃҄҅҆҇҈҉ҊҋҌҍҎҏҐґҒғҔҕҖҗҘҙҚқҜҝҞҟҠҡҢңҤҥҦҧҨҩҪҫҬҭҮүҰұҲҳҴҵҶҷҸҹҺһҼҽҾҿӀӁӂӃӄӅӆӇӈӉӊӋӌӍӎӏӐӑӒӓӔӕӖӗӘәӚӛӜӝӞӟӠӡӢӣӤӥӦӧӨөӪӫӬӭӮӯӰӱӲӳӴӵӶӷӸӹӺӻӼӽӾӿ".toCharArray();
        if (value < 0 || value >= base) {
            throw new IllegalArgumentException("Valor inválido: " + value);
        }
        return chars[value];
    }
}
